charliermarsh.ruff
dbaeumer.vscode-eslint
esbenp.prettier-vscode
emeraldwalk.runonsave
matangover.mypy
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
reditorsupport.r
reditorsupport.r-syntax
tamasfe.even-better-toml
vscodevim.vim
hoovercj.vscode-settings-cycler
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-french
